In [1]:
import pandas as pd

In [2]:
pd.read_csv("fortune500.csv")

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
...,...,...,...,...,...
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [3]:
df = pd.read_csv("fortune500.csv")

In [4]:
print(df)

       Year  Rank                Company  Revenue (in millions)  \
0      1955     1         General Motors                 9823.5
1      1955     2            Exxon Mobil                 5661.4
2      1955     3             U.S. Steel                 3250.4
3      1955     4       General Electric                 2959.1
4      1955     5                 Esmark                 2510.8
...     ...   ...                    ...                    ...
25495  2005   496        Wm. Wrigley Jr.                 3648.6
25496  2005   497         Peabody Energy                 3631.6
25497  2005   498  Wendy's International                 3630.4
25498  2005   499     Kindred Healthcare                 3616.6
25499  2005   500   Cincinnati Financial                 3614.0

      Profit (in millions)
0                      806
1                    584.8
2                    195.4
3                    212.6
4                     19.1
...                    ...
25495                  493
25496                175.4
25497                 57.8
25498                 70.6
25499                  584

[25500 rows x 5 columns]

In [5]:
df

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
...,...,...,...,...,...
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [6]:
pd.set_option("display.max_columns",100)
pd.set_option("display.max_rows",20)

In [7]:
df.head(10)

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1
5  1955     6          Chrysler                 2071.6                 18.5
6  1955     7            Armour                 2056.1                  1.6
7  1955     8          Gulf Oil                 1705.3                182.8
8  1955     9             Mobil                 1703.6                183.8
9  1955    10            DuPont                 1687.7                344.4

In [8]:
df.tail(20)

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
25480,2005,481,Sealed Air,3798.1,215.6
25481,2005,482,Maxtor,3796.3,-181.9
25482,2005,483,Reebok International,3785.3,192.4
25483,2005,484,UGI,3784.7,111.6
25484,2005,485,Guidant,3775.2,524
25485,2005,486,Host Marriott,3773.0,N.A.
25486,2005,487,Advance Auto Parts,3770.3,188
25487,2005,488,ServiceMaster,3759.6,331.2
25488,2005,489,Wesco International,3741.3,64.9
25489,2005,490,Telephone & Data Sys.,3720.4,49
25490,2005,491,Level 3 Communications,3712.0,-458
25491,2005,492,Brinker International,3707.5,154
25492,2005,493,Stater Bros. Holdings,3704.9,71.8
25493,2005,494,Western & Southern Financial,3694.5,328
25494,2005,495,Gateway,3649.7,-567.6
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [9]:
df

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
...,...,...,...,...,...
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

특정 칼럼에 데이터를 보고싶다.

In [10]:
df["Company"]

0               General Motors
1                  Exxon Mobil
2                   U.S. Steel
3             General Electric
4                       Esmark
                 ...
25495          Wm. Wrigley Jr.
25496           Peabody Energy
25497    Wendy's International
25498       Kindred Healthcare
25499     Cincinnati Financial
Name: Company, Length: 25500, dtype: object

하나의 칼럼의 데이터를 보자고 할떄

In [11]:
type(df["Company"])

pandas.core.series.Series

2개 이상의 칼럼을 데이터를 보려고할때 리스트로 제공 [[]]를 쓴다

In [12]:
df[["Rank","Company"]]

       Rank                Company
0         1         General Motors
1         2            Exxon Mobil
2         3             U.S. Steel
3         4       General Electric
4         5                 Esmark
...     ...                    ...
25495   496        Wm. Wrigley Jr.
25496   497         Peabody Energy
25497   498  Wendy's International
25498   499     Kindred Healthcare
25499   500   Cincinnati Financial

[25500 rows x 2 columns]

위 애가 지원하는 타입은?

In [13]:
type(df[["Rank","Company"]])

pandas.core.frame.DataFrame

In [15]:
person = {
    "first" : "Giodong",
    "last" : "Hone",
    "email" : "gdhone@gmail.com"
}

In [22]:
people = {
    "first" : ["Gildong","ChunHyang","Mongryoung"],
    "last" : ["Hone", "Sung", "Lee"],
    "email" : ["gdhong@gmail.com","chs@gmail.com","mrlee@gmail.com"]
}

In [17]:
people

{'first': ['Gildong'], 'last': ['Hone'], 'email': ['gdhone@gmail.com']}

In [18]:
print(people)

{'first': ['Gildong'], 'last': ['Hone'], 'email': ['gdhone@gmail.com']}

In [19]:
print(person)

{'first': 'Giodong', 'last': 'Hone', 'email': 'gdhone@gmail.com'}

In [24]:
people["first"]

['Gildong', 'ChunHyang', 'Mongryoung']

In [27]:
df =pd.DataFrame(people);

In [34]:
df

        first  last             email
0     Gildong  Hone  gdhong@gmail.com
1   ChunHyang  Sung     chs@gmail.com
2  Mongryoung   Lee   mrlee@gmail.com

이 쪽이 더 좋아 df['email']

In [29]:
df['email']

0    gdhong@gmail.com
1       chs@gmail.com
2     mrlee@gmail.com
Name: email, dtype: object

In [30]:
df.email

0    gdhong@gmail.com
1       chs@gmail.com
2     mrlee@gmail.com
Name: email, dtype: object

라스트 칼럼, 이메일 칼럼만 뽑아내봐

In [37]:
df[["email","last"]]

              email  last
0  gdhong@gmail.com  Hone
1     chs@gmail.com  Sung
2   mrlee@gmail.com   Lee

In [38]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

loc, iloc을 사용해 특정 행과 열을 인출 할 수있다.

In [41]:
df.iloc[0]

first             Gildong
last                 Hone
email    gdhong@gmail.com
Name: 0, dtype: object

df.iloc[0] : 난 첫번째 행만 출력 할거야~ (0이 첫번째 행)

In [43]:
df.iloc[[0,1]]

       first  last             email
0    Gildong  Hone  gdhong@gmail.com
1  ChunHyang  Sung     chs@gmail.com

df.iloc[[0,1]] 0번행과 1번행만 나오게~

시험 @@ 코드 결과물제출

In [44]:
df.iloc[[0,1],2]

0    gdhong@gmail.com
1       chs@gmail.com
Name: email, dtype: object

df.iloc[[0,1],2] 0,1 행에 2번 칼럼만 빼 낼수 있다